src/cf/InformationRegisters/ПорядокПроектныхЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПорядокПроектныхЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПроектнаяЗадача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ПорядокПроектныхЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Устанавливает признак Прочтен для объекта у Пользователя (ТекущегоПользователя).
//
Процедура УстановитьПорядокПроектнойЗадачи(ПроектнаяЗадача, НомерПорядка) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
		
	Запись = РегистрыСведений.ПорядокПроектныхЗадач.СоздатьМенеджерЗаписи();
	Запись.ПроектнаяЗадача = ПроектнаяЗадача;
	Запись.Прочитать();
	
	Запись.ПроектнаяЗадача = ПроектнаяЗадача;
	Запись.Порядок = НомерПорядка;
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецЕсли
